## 1. Дано целое число A. Проверить истинность высказывания: «Число A является
## нечетным».

A = int(input('Введите число (A):'))

x = A%2

print('Число нечетно:',x==1)

## 2. При открытии вклада в банке установлены следующие годовые проценты: при
## вкладе до 50000р. процент составит 4%; при вкладе от 50000р. до 100000р. процент
## составит 5%; при вкладе от 100000р. до 150000р. скидка составит 6%; при вкладе от
## процентной ставки в зависимости от вносимой суммы.


